In [1]:
%load_ext sql
%sql sqlite:///PS1.db

u'Connected: None@PS1.db'

Problem Set 1
=======


### Instructions / Notes:

**_Read these carefully_**

* Run the top cell above to load the database `PS1.db` (make sure the actual database file, `PS1.db`, is in the same directory as this IPython notebook is running in)
* Some of the problems involve _changing_ this database (e.g. deleting rows)- you can always re-download `PS1.db` or make a copy if you want to start fresh!
* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that your final answer for each question is _in its own cell_ and _clearly indicated_**
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_.
    * **If the cell is hanging- i.e. running for too long: To restart the SQL connection, you must restart the entire python kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute the sql connection cell at top
    * You will also need to restart the connection if you want to load a different version of the database file
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql [SQL]` is for _multi line_ SQL queries
* **See Piazza for submission instructions**
* _Have fun!_

Problem 1: Linear Algebra
------------------------

Two random 3x3 ($N=3$) matrices have been provided in tables `A` and `B`, having the following schema:
> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

**Note: all of your answers below _must_ work for any _square_ matrix sizes, i.e. any value of $N$**.

Note how the matrices are represented- why do we choose this format?  Run the following queries to see the matrices in a nice format:

In [2]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

Done.

[(u'7 , 5 , 8',), (u'10 , 7 , 7',), (u'2 , 0 , 5',)]

In [3]:
%sql SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

Done.

[(u'9 , 6 , 10',), (u'7 , 6 , 9',), (u'1 , 1 , 7',)]

### Part (a): Matrix transpose

_Transposing_ a matrix $A$ is the operation of switching its rows with its columns- written $A^T$.  For example, if we have:

$A=\begin{bmatrix}a & b & c\\ d & e & f\\ g & h & i\end{bmatrix}$

Then:

$A^T=\begin{bmatrix}a & d & g\\ b & e & h\\ c & f & i\end{bmatrix}$

Write a _single SQL query_ to get the matrix transpose $A^T$ (in the same format as $A$- output tuples should be of format `(i,j,val)` where `i` is row, `j` is column, and the output is ordered by row then column index)

Write your query here:

In [4]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(0, 0, 7),
 (0, 1, 10),
 (0, 2, 2),
 (1, 0, 5),
 (1, 1, 7),
 (1, 2, 0),
 (2, 0, 8),
 (2, 1, 7),
 (2, 2, 5)]

### Part (b): Dot product I

The _dot product_ of two vectors

$a = \begin{bmatrix}a_1 & a_2 & \dots & a_n\end{bmatrix}$

and

$b = \begin{bmatrix}b_1 & b_2 & \dots & b_n\end{bmatrix}$

is

$a\cdot b = \sum_{i=1}^n a_ib_i = a_1b_1 + a_2b_2 + \dots + a_nb_n$

Write a _single SQL query_ to take the dot product of the **second column of $A$** and the **third column of $B$.**

Write your query here:

In [5]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(113,)]

### Part (c): Dot product II

Write a _single SQL query_ to take the dot product of the **second _row_ of $A$** and the **third column of $B$.**

Write your query here:

In [6]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(212,)]

### Part (d): Matrix multiplication

The product of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $m\times p$) is the matrix $C$ (of dimension $n\times p$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = \sum_{k=1}^m A_{ik}B_{kj}$

In other words, to multiply two matrices, get each cell of the resulting matrix $C$, $C_{ij}$, by taking the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a single SQL query to get the matrix product of $A$ and $B$ (in the same format as $A$ and $B$).

Write your query here:

In [7]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

Problem 2: U.S. Hourly NOAA Precipitation dataset
----------------------------------------------

We've prepared and loaded a [public dataset](https://catalog.data.gov/dataset/u-s-hourly-precipitation-data) from the US NOAA (National Oceanic and Atmospheric Administration) of daily precipitation data from different weather stations fom the month of Sep. 2013.  We'll use the `precipitation` table here, which has a simplified schema:

> `station_id INT`

> `day INT`

> `precipitation INT`

In [8]:
%sql SELECT * FROM precipitation LIMIT 3;

Done.

[(16102, 1, 10), (16102, 4, 10), (16102, 24, 30)]

### Part (a): Precipitation Champions

Using a _single SQL query_, find all of the stations that had the highest daily precipitation (across all stations) on any given day **more than once**, and return the counts of how many "best days" they had in descending order.  Further requirements:
* Use `GROUP BY`
* Write the shortest possible SQL query to accomplish this
* Return relation `(station_id, num_best_days)`

*Hint: Make sure your query correctly handles ties!*

Write your query here:

In [9]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(335701, 6), (92707, 3), (225707, 2), (458701, 2), (611807, 2), (734201, 2)]

### Part (b.i): Median value, Pt. I

Our goal in this part is going to be to find the **median value** of a list of values.  We want to do this for the general case, however we'll start with a slightly simplified setting:

Write a _single SQL query_ to find the median value of a certain attribute in a table, given that:
* The table contains an odd number of rows
* The values of this attribute are unique in the table (e.g. no two rows have the same value for this attribute)

Also, **do not hard code the size of the table and/or use any `ORDER BY` clause.  Think about the definition of median!**

Let's test using the table $X$, constructed out of the distinct precipitation values of all stations on all days, having one attribute $p$:

In [10]:
%%sql
DROP TABLE IF EXISTS X;
CREATE TABLE X AS SELECT DISTINCT precipitation AS p FROM precipitation;
SELECT COUNT(*) FROM X;

Done.
Done.
Done.

[(59,)]

Write your query here:

In [11]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(51,)]

### Part (b.ii): Median value, Pt. II

Now, we want to find the median precipitation value across all days for a station `376101`.  **However to get credit, your query must work for ALL stations- test it on some others to be certain it's correct!**

Again, do not hardcode the size of any table and/or use any `ORDER BY` clause.

Note that now:
* The number of rows can be even
* The values can have duplicates

Also note that we will use the definition of _median_ where ties (e.g. when there are an even number of rows) are broken by averaging.  Write your query here:

In [12]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(15.0,)]

### Part (c):

Write a _single SQL query_ to find stations which had a _smallest rainy day precipitation value_ (i.e. smallest non-zero `precipitation`) that was **within 400** of the _largest overall precipitation value_ (across all stations & all days).  Return tuples of type `(station_id, min_rainy_day_precip)`.

*Note: do not hard-code the maximum daily precipitation value, or any other values.*

**Do this using `GROUP BY` and aggregate functions (e.g. `COUNT`, `SUM`, `MAX`, `MIN`)**.  Write your query here:

In [13]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(88302, 190),
 (100504, 90),
 (127705, 70),
 (146002, 90),
 (196404, 65),
 (229402, 70),
 (293502, 120),
 (303805, 120),
 (357302, 100),
 (393905, 70),
 (471202, 60),
 (538802, 74),
 (652102, 80),
 (696402, 100),
 (782104, 66),
 (985505, 90)]

### Part (d):

Do the same as above, except do **not** use `GROUP BY` or any aggregate functions.  Write your query here:

In [14]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(88302, 190),
 (100504, 90),
 (127705, 70),
 (146002, 90),
 (196404, 65),
 (229402, 70),
 (293502, 120),
 (303805, 120),
 (357302, 100),
 (393905, 70),
 (471202, 60),
 (538802, 74),
 (652102, 80),
 (696402, 100),
 (782104, 66),
 (985505, 90)]

Problem 3: The Traveling SQL Server Salesman Problem
--------------------------------------------------

SQL Server salespeople are lucky as far as traveling salespeople go- they only have to sell one or two big enterprise contracts, at one or two offices in Wisconsin, in order to make their monthly quota!

Answer the following questions using the table of streets connecting company office buildings.

**Note that for convenience all streets are included _twice_, as $A \rightarrow B$ and $B \rightarrow A$.  This should make some parts of the problem easier, but remember to take it into account!**

In [15]:
%sql SELECT * FROM streets LIMIT 4;

Done.

[(0, u'F', u'UW-Madison', u'DooHickey Collective', 7),
 (0, u'R', u'DooHickey Collective', u'UW-Madison', 7),
 (1, u'F', u'DooHickey Collective', u'Gizmo Corp', 2),
 (1, u'R', u'Gizmo Corp', u'DooHickey Collective', 2)]

### Part (a): One-hop, two-hop, three-hop...

Our salesperson has stopped at UW-Madison, to steal some cool new RDBMS technology from CS564-ers, and now wants to go sell it to a company _within 10 miles of UW-Madison and _passing through no more than 3 distinct streets_.  Write a single query, not using `WITH` (see later on), to find all such companies.

Your query should return tuples `(company, distance)` where distance is cumulative from UW-Madison.

Write your query here:

In [16]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(u'DooHickey Collective', 7),
 (u'DooHickey Corp', 9),
 (u'Gadget Collective', 9),
 (u'Gadget Corp', 6),
 (u'Gizmo Corp', 9),
 (u'Widget Industries', 10)]

### Part (b): A stop at the Farm

Now, our salesperson is out in the field, and wants to see all routes- and their distances- which will take him/her from a company $A$ to a company $B$, with the following constraints:
* The route must _pass through UW-Madison (in order to pick up new RDBMS tech to sell!)
* $A$ and $B$ must _each individually_ be _within 3 hops of UW-Madison
* $A$ and $B$ must be different companies
* _The total distance must be $<= 15$_
* Do not use `WITH`
* If you return a path $A \rightarrow B$, _also include $B \rightarrow A$ in your answer_

In order to make your answer a bit cleaner, you may split into two queries, one of which creates a `VIEW`.  A view is a virtual table based on the output set of a SQL query.  A view can be used just like a normal table- the only difference under the hood is that the DBMS re-evaluates the query used to generate it each time a view is queried by a user (thus the data is always up-to date!)

Here's a simple example of a view:

In [17]:
%%sql 
DROP VIEW IF EXISTS short_streets;
CREATE VIEW short_streets AS 
SELECT A, B, d FROM streets WHERE d < 3;
SELECT * FROM short_streets LIMIT 3;

Done.
Done.
Done.

[(u'DooHickey Collective', u'Gizmo Corp', 2),
 (u'Gizmo Corp', u'DooHickey Collective', 2),
 (u'Gizmo Corp', u'Widget Industries', 1)]

Write your query or queries here:

In [18]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.
Done.
Done.

[(u'DooHickey Collective', u'Gadget Corp', 13),
 (u'DooHickey Corp', u'Gadget Corp', 15),
 (u'Gadget Collective', u'Gadget Corp', 15),
 (u'Gadget Corp', u'DooHickey Collective', 13),
 (u'Gadget Corp', u'DooHickey Corp', 15),
 (u'Gadget Corp', u'Gadget Collective', 15),
 (u'Gadget Corp', u'Gizmo Corp', 15),
 (u'Gizmo Corp', u'Gadget Corp', 15)]

### Part (c): Ensuring acyclicity

You may have noticed at this point that the network, or **_graph_**, of streets in our `streets` table seems like it might be a **tree**.

Recall that a **_tree_** is an undirected graph where each node has exactly one parent (or, is the root, and has none), but may have multiple children.  A slightly more formal definition of a tree is as follows: 

> An undirected graph $T$ is a **_tree_** if it is **connected**- meaning that there is a path between every pair of nodes- and has no **cycles** (informally, closed loops)

Suppose that we guarantee the following about the graph of companies & streets determined by the `streets` table:
* It is _connected_
* It has no cycles of length $> 3$

Write a _single SQL query_ which, if our graph is not a tree (i.e. if this isn't a [shaggy dog problem](https://en.wikipedia.org/wiki/Shaggy_dog_story)), **turns it into a tree** by deleting exactly _one_ street (*= two entries in our table!*).  Write your query here:

In [19]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

2 rows affected.

[]

### Part (d): The longest path

In this part, we want to find the distance of the _longest path between any two companies_.

Note that you should probably have done Part (c) first so that the graph of streets is a _tree_- this will make it much easier to work with!

If you've done the other parts above, you might be skeptical that SQL can find paths of arbitrary lengths (which is what we need to do for this problem); how can we do this?

There are some non-standard SQL functions- i.e. not universally supported by all SQL DBMSs- which are often incredibly useful.  One of these is the `WITH RECURSIVE` clause, supported by SQLite.

A `WITH` clause lets you define what is essentially a view within a clause, mainly to clean up your SQL code.  A trivial example, to illustrate `WITH`:

In [20]:
%%sql
WITH companies(name) AS (
    SELECT DISTINCT A FROM streets)
SELECT * 
FROM companies 
WHERE name LIKE '%Gizmo%';

Done.

[(u'Gizmo Corp',),
 (u'GizmoWorks',),
 (u'Gizmo Industries',),
 (u'Gizmo Collective',),
 (u'GizmoCo',)]

There is also a recursive variant, `WITH RECURSIVE`.  `WITH RECURSIVE` allows you to define a view just as above, except the table can be defined recursively.  A `WITH RECURSIVE` clause must be of the following form:

```
WITH RECURSIVE 
    R(...) AS (
        SELECT ... 
        UNION [ALL] 
        SELECT ... FROM R, ...
    )
...
```

`R` is the _recursive table_.  The `AS` clause contains two `SELECT` statements, conjoined by a `UNION` or `UNION ALL`; the first `SELECT` statement provides the initial / base case values, and the second or _recursive_ `SELECT` statement must include the recursive table in its `FROM` clause.

Basically, the recursive `SELECT` statement continues executing on the tuple _most recently inserted into `R`_, inserting output rows back into `R`, and proceeding recursively in this way, until it no longer outputs any rows, and then stops.  See the [SQLite documentation](https://www.sqlite.org/lang_with.html) for more detail.

The following example computes $5! = 5*4*3*2*1$ using `WITH RECURSIVE`:

In [21]:
%%sql
WITH RECURSIVE
    factorials(n,x) AS (
        SELECT 1, 1
        UNION
        SELECT n+1, (n+1)*x FROM factorials WHERE n < 5)
SELECT x FROM factorials WHERE n = 5;

Done.

[(120,)]

In this example:

1. First, `(1,1)` is inserted into the table `factorials` (the base case).
2. Next, this tuple is returned by the recursive select, as `(n, x)`, and we insert the result back into `factorials`: `(1+1, (1+1)*1) = (2,2)`
3. Next, we do the same with the last tuple inserted into `factorials`- `(2,2)`- and insert `(2+1, (2+1)*2) = (3,6)`
4. And again: get `(3,6)` from `factorials` and insert `(3+1, (3+1)*6) = (4,24)` back in
5. And again: `(4,24)` -> `(4+1, (4+1)*24) = (5,120)`
6. Now the last tuple inserted into `factorials` is `(5, 120)`, which fails the `WHERE n < 5` clause, and thus our recursive select returns an empty set, and our `WITH RECURSIVE` statement concludes
7. Finally, now that our `WITH RECURSIVE` clause has concluded, we move on to the `SELECT x FROM factorials WHERE n=5` clause, which gets us our answer!

#### Now, your turn!

Write a single SQL query that uses `WITH RECURSIVE` to find the furthest (by distance) pair of companies that still have a path of streets connecting them.  Your query should return `(A, B, distance)`.

Write your query here:

In [22]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(u'GadgetWorks', u'ThingWorks', 63)]

### Note on alternate output

**NOTE:** The **_distance_** of the longest path could be **49 _OR_ 63** depending on which street you deleted in Part (c)!

### Bonus Problem: The longest path, Pt. II

Using `WITH RECURSIVE` may be a little tricky syntactically, but it is quite elegant.  What would alternatives look like?  We already know we can't do it with non-recursive SQL.

For this problem, **use SQL _and_ Python** to find the longest path (by cumulative distance) between two companies in the streets graph, **without using a `WITH` clause**, again returning a single tuple of the form `(A, B, distance)`.

_Note: Be careful of trivial cycles in the graph!  Especially if you write recursive functions in your python code, note that IPython handles hitting the max recursion depth pretty poorly (i.e. crashes / freezes up).  You can debug in a normal terminal first if this is a concern._

Write your code / queries here:

In [23]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.
Done.
(u'ThingWorks', u'GadgetWorks', 63)

### Note on alternate output

**NOTE:** The **_distance_** of the longest path could be **49 _OR_ 63** depending on which street you deleted in Part (c)!